blog/2021/hugo-open-internal-links-in-same-tab-external-links-in-new-tab.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 16:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Hugo 内链当前标签页打开，外链新标签页打开</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Hugo 内链当前标签页打开，外链新标签页打开</h1>
</header>
<div id="outline-container-例子" class="outline-2">
<h2 id="例子">例子</h2>
<div class="outline-text-2" id="text-例子">
<ul class="org-ul">
<li><a href="https://yihui.org/cn/">https://yihui.org/cn/</a></li>
<li><a href="https://io-oi.me/">https://io-oi.me/</a></li>
</ul>
</div>
</div>

<div id="outline-container-实现" class="outline-2">
<h2 id="实现">实现</h2>
<div class="outline-text-2" id="text-实现">
<p>
在 Hugo 博客的博客单页面（single.html）中，修改 <code>{{ .Content }}</code> 为
</p>

<pre class="example" id="org38afa83">
{{ $content := .Content }}
{{ $content = replaceRE `&lt;a href="(https?://.+)"&gt;` `&lt;a href="$1" target="_blank" rel="noopener"&gt;` $content | safeHTML }}
{{ $content | safeHTML }}
</pre>

<p>
这样就可以实现「内链当前标签页打开，外链新标签页打开」。这可能是应用了「正则表达式」，我还不太了解。Hugo
的语法我还不了解。
</p>

<hr>

<p>
*参考资料*：
</p>

<ol class="org-ol">
<li><a href="https://discourse.gohugo.io/t/how-to-open-plain-url-links-in-a-new-tab/25523/6">https://discourse.gohugo.io/t/how-to-open-plain-url-links-in-a-new-tab/25523/6</a></li>
<li><a href="https://github.com/reuixiy/hugo-theme-meme/blob/d392ab1814/layouts/partials/utils/markdownify.html?rgh-link-date=2021-01-12T04%3A02%3A06Z#L27">https://github.com/reuixiy/hugo-theme-meme/blob/d392ab1814/layouts/partials/utils/markdownify.html?rgh-link-date=2021-01-12T04%3A02%3A06Z#L27</a></li>
<li><a href="https://stackoverflow.com/a/4425214/12539782">https://stackoverflow.com/a/4425214/12539782</a></li>
<li><a href="https://discourse.gohugo.io/t/internal-links-in-same-tab-external-links-in-new-tab/11048/9">https://discourse.gohugo.io/t/internal-links-in-same-tab-external-links-in-new-tab/11048/9</a></li>
</ol>
</div>
</div>
</div>
</body>
</html>